[
{"pageid": "apply.php", "url": "https://www.kennesaw.edu/apply.php", "title": "Application Information - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Apply to KSU Kennesaw State University Application Information Undergraduate Application Graduate Application Professional Education Undergraduate Application Our number one priority at KSU is you and your success. We want your application process to be simple and exciting, no matter your application type. We’re excited that you’ve chosen KSU as your academic doorway to reach your future potential and purpose. We are here to help you during the entire application process. Welcome, future KSU Owls! apply learn more Graduate Application KSU gives you the tools needed to advance in your career and find your path to success. We support our graduates in returning to academia to become professionals that excel in their field of interest. Our application process is straightforward and simple to save you time and effort. Get started on your graduate application today to start enhancing your skills as a KSU Owl. apply learn more Professional Education at KSU It’s Your Profession. Soar Higher. It’s time to start investing in yourself. Apply for a professional program at Kennesaw State to advance and skills to reach your professional and career goals faster. Get ahead with professional certificates, corporate learning opportunities, community programs and more! apply learn more Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "visit.php", "url": "https://www.kennesaw.edu/visit.php", "title": "Visit - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Visit KSU Kennesaw State University Visit Ways to Tour Plan Your Visit Undergraduate Open House Visitor Information Welcome, Future KSU Owls! Kennesaw State University is passionate about supporting you from the moment you step foot onto our campuses. We want you to see and experience what Owl Life is really like. With various ways to visit, our campus tours offer you a birds-eye view of all the places of interest you need to know about before you decide to join the Nest. There are Various Ways to Tour KSU Visiting our campuses is a wonderful opportunity for future students, families and visitors to explore the KSU culture, experience the energy and learn about our Owl Nation. Both the Kennesaw and Marietta campuses are vibrant and teeming with spirit! Our tours are designed to answer your questions and meet your needs so visiting Kennesaw State is a breeze. Experience KSU in Person Schedule a Campus Tour High School Group Tours Experience KSU from Home Kennesaw State Virtual Tour Interactive Maps Plan Your Visit Our Campus programs and departments have exciting and interactive events that happen year-round. As you make your plans to visit Kennesaw State, please check out the following to make sure your visit goes smoothly. We hope you come to love KSU as much as we do. Need Directions? Kennesaw State University has two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA, just off Interstate 75. Kennesaw Campus Kennesaw Campus 1000 Chastain RoadKennesaw, GA 30144Phone: 470-578-6000 Kennesaw Campus Map Marietta Campus Marietta Campus 1100 South Marietta PkwyMarietta, GA 30060Phone: 470-578-6000 Marietta Campus Map Don’t Wait to Visit KSU! Schedule a Tour today! Schedule a Tour for Kennesaw & Marietta Campuses Parking & Campus Transportation Information We welcome all visitors to Kennesaw State year-round for community events, tours and more. We provide convenient parking payments through the ParkMobile app for visitors at both campuses. Additionally, visit our Pay-per-Plate kiosks in each of our Visitor parking areas. Where to Park at KSU KSU Visitor Information Before you leave, make sure you check out our award-winning dining facilities and our KSU stores where you can shop for future Owl merch! We also want to make sure your visit is safe and secure. Check out our Campus Safety information before planning your visit. We can’t wait to see you here! University Dining KSU Shopping Campus Safety Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "open_records_requests.php", "url": "https://legal.kennesaw.edu/open_records_requests.php", "title": "Open Record Requests - Division of Legal Affairs | KSU", "body": "Oops! You don't have Javascript enabled. Some features on this site might not work correctly. Kennesaw State University Division of Legal Affairs Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU About KSU Academics Admissions Student Life Research Alumni Athletics HomeAbout UsMission StatementStaffContact UsContractsOpen Record RequestsResourcesFAQs - GeneralFAQs - First Amendment and KSURelated LinksCampus Policies (Policy Portal) Home / Open Record Requests HomeAbout UsMission StatementStaffContact UsContractsOpen Record RequestsResourcesFAQs - GeneralFAQs - First Amendment and KSURelated LinksCampus Policies (Policy Portal) Open Record Requests The Georgia Open Records Act is a state statute that applies to all departments and individuals within Kennesaw State University. The Act requires that public records be open and available for inspection by a requesting party within a reasonable amount of time after the receipt of the request, unless the records are those exempted by law from disclosure (e.g., student educational records). The Act also requires an initial response within three (3) business days to all Open Records Act requests received by a university official (faculty, staff or administrator). Failure to do so may result in penalties for the university official under the provisions of the law. There are some exceptions to the Open Records Act, including medical records and student academic records. Kennesaw State University has designated the General Counsel as the Open Records Officer for the University, and is the official to whom all Open Records Act requests should be made. Please send all Open Records requests to asklegal@kennesaw.edu or to: Kennesaw State UniversityDivision of Legal AffairsMD #9115, Town Point, Suite 34003391 Town Point Dr NWKennesaw, GA 30144 Any Open Records requests must be forwarded immediately upon receipt to the KSU Office of Legal Affairs for initial response on behalf of the University. The Office of Legal Affairs will also be responsible for collecting documents that are responsive to the Open Records request (if any), and will provide the documents for review to the requesting party at a mutually convenient time. In order to avoid delay and to have sufficient time to respond before the 3-day deadline, Open Records requests received by University personnel must be faxed, e-mailed, or delivered in person to the Office of Legal Affairs. Please see our contact information page. Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": ["asklegal@kennesaw.edu", "asklegal@kennesaw.edu"]},
{"pageid": "give.php", "url": "https://www.kennesaw.edu/give.php", "title": "Give - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Give to KSU Kennesaw State University Give Ways to Give Office of Development KSU Foundation Your gift to Kennesaw State University helps make a meaningful difference for generations to come. You can be a part of advancing the university's goals by making a gift to campus initiatives, specific programs, scholarships and/or colleges. Gift opportunities are also available for cultural, athletic or educational outreach programs. Donors at Kennesaw State are One of Our Greatest Assets Our continued support from friends, faculty, staff, alumni, and parents has enabled KSU to reach a greater level of excellence and attract top-notch undergraduate and graduate students. Our university remains a leader in higher education thanks to the charitable gifts we receive from our generous donors. At KSU, donors truly make all the difference. Ways to Give to KSU There are many ways you can invest in Kennesaw State. We support your gifting through credit cards, checks, money orders and electronic funds transfers. You may also invest in KSU with a bequest or life income gift. Our staff is always happy to assist you in finding the type of gift that best meets your giving needs. Give to KSU Online We accept all gifts including: Online Giving Mail Recurring Credit/Debit Card Draft Faculty / Staff Payroll Deduction Matching Gifts Stocks and Other Securities Gift Planning Memorial Gifts Gifts-in-Kind Office of Development Our Office of Development at Kennesaw State is dedicated to supporting our diverse giving communities and families. We meet you where you are and make your giving goals and dreams possible with various ways to give, friendly staff members to help direct your gifts and facilitate exciting donor features across the University. Where to Give Friends & Family Faculty & Staff Scholarships Gift Planning Visit the Office of Development See how your gift can be used for future KSU students KSU Foundation Our Kennesaw State University Foundation, Inc. is a nonprofit corporation that focuses on furthering the interests of KSU by supporting, guiding and protecting the university when receiving private gifts. We are committed to enhancing higher education for our faculty, staff and students and increasing the quality of life on our campuses. KSU Foundation Learn more about our gift goals, strategic plan and important projects Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "calendar.php", "url": "https://www.kennesaw.edu/calendar.php", "title": "University Calendars - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar University Calendars Kennesaw State University University Calendars Event Calendar Academic Calendar Athletics Calendar KSU Event CalendarSee all events KSU Fall 2023 Academic Calendar See all academic calendars 15-WEEK Registration (See Time Ticket Matrix for Details)NOTE: eCore Dates May Differ – See Link at Bottom Begins 8:00 a.m. March 10, 2023 (F) – August 9, 2023 (W), ending at 11:45 p.m. First Day of Classes Aug 14 (M) Registration / Drop-Add (Begins 8:00 a.m., Ends 11:45p.m.) NOTE: eCore Dates May Differ – See Link at Bottom Aug 14 (M) – 18 (F) Payment Deadline * (Includes eCore) Aug 18 (F) Financial Aid Disbursement Aug 25 (F) Deletion of Courses for Nonpayment ** (Includes eCore) Aug 28 (M) Holidays / Breaks Sep 4 (M) & Nov 20 (M) – 26 (Su) Midterm Grades Due Oct 3 (Tu) Last Day to Withdraw W/out Academic Penalty, 11:45 p.m. Oct 10 (Tu) Last Day of Classes Dec 4 (M) Final Exams Dec 5 (Tu) – Dec 11 (M) Final Grades Due by NOON Dec 14 (Th) Commencement Dec 12 (Tu) – Dec 13 (W) – Dec 14 (Th) – Dec 15 (F) 7-WEEK I Registration (See Time Ticket Matrix for Details)NOTE: eCore Dates May Differ – See Link at Bottom Begins 8:00 a.m. March 10, 2023 (F) – August 9, 2023 (W), ending at 11:45 p.m. First Day of Classes Aug 14 (M) Registration / Drop-Add (Begins 8:00 a.m., Ends 11:45p.m.) NOTE: eCore Dates May Differ – See Link at Bottom Aug 14 (M) – 18 (F) Payment Deadline * (Includes eCore) Aug 18 (F) Financial Aid Disbursement Aug 25 (F) Deletion of Courses for Nonpayment ** (Includes eCore) Aug 28 (M) Holidays / Breaks Sep 4 (M) Midterm Grades Due Aug 31 (Th) Last Day to Withdraw W/out Academic Penalty, 11:45 p.m. Sep 7 (Th) Last Day of Classes Oct 2 (M) Final Exams Oct 3 (Tu) – Oct 4 (W) Final Grades Due by NOON Oct 9 (M) Commencement Dec 12 (Tu) – Dec 13 (W) – Dec 14 (Th) – Dec 15 (F) 7-WEEK II Registration (See Time Ticket Matrix for Details)NOTE: eCore Dates May Differ – See Link at Bottom Begins 8:00 a.m. March 10, 2023 (F) – August 9, 2023 (W), ending at 11:45 p.m. First Day of Classes Oct 10 (Tu) Registration / Drop-Add (Begins 8:00 a.m., Ends 11:45p.m.) NOTE: eCore Dates May Differ – See Link at Bottom Aug 14 (M) – 18 (F); Oct 3 (Tu) – 11 (W) Payment Deadline * (Includes eCore) Aug 18 (F) for registrations before Aug 19; Oct 11 (W) for registrations in October Financial Aid Disbursement Aug 25 (F) for registrations before Aug 19; Oct 16 (M) for registrations in October Deletion of Courses for Nonpayment*(includes eCore) Aug 28 (M)for registrations before Aug 19; Oct 17 (Tu) for registrations in October Holidays / Breaks – No Classes Nov 20 (M) – 26 (Su) Mid-Term Grades Due Oct 26 (Th) Last Day to Withdraw Without Academic Penalty, 11:45 p.m. Nov 2 (Th) Last Day of Classes Dec 4 (M) Final Exams Dec 5 (Tu) – Dec 11 (M) Final Grades Due by Noon Dec 14 (Th) Commencement Dec 12 (Tu) – Dec 13 (W) – Dec 14 (Th) – Dec 15 (F) *Deletion applies to the entire registration, if not paid by the payment deadline. Credit card payments can be made via Owl Express. Cash/check payments are due in Bursar’s Office by 4:00 p.m. A late payment fee of $50 will be applied. Su = Sunday, M = Monday, Tu = Tuesday, W = Wednesday, Th = Thursday, F = Friday, Sa = Saturday Fall 2023 eCore Calendar https://ecore.usg.edu/courses/calendar/index.php NOTE: eCore Calendar dates may differ from KSU’s Calendar dates. Students enrolling in eCore courses must adhere to the USG published dates listed on the eCore website. KSU Athletics Calendar Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/current-students/", "title": "Current Student Information - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Current Student Information Kennesaw State University Current Students D2L Brightspace KSUMail Owl Express DegreeWorks KCash Handshake My Sports Rec Owl Life Course Evaluations A-Z Index Tutoring Resources Library Dining Parking & Transportation University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKSU unveils upgraded recreation and wellness center at Marietta campus Upcoming EventsSee all events Resources Computing Resources University Information Technology Services Service Portal Academic Resources Advising Global Education Learn Online Library Handbooks Owl Advising Registrar SMART Center Testing Center Writing Center Algebra Tutoring Athletics & Recreation Esports KSU Owls Fifth Third Bank Stadium Sports & Recreation Campus Services KSU Dining KSU Housing KSU Stores Events & Venue Management Parking & Transportation Public Safety & Police Student Health Talon Card Talon One Service Center Campus Services Finances Bursar's Office Financial Aid Financial Management Tuition and Fees International Community Global Education Global Village Maya Project Latino Program English Language Program Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Student Life Marching Band Club Sports Student Leadership & Service African American Male Initiative Student Government Association Get Involved Owl Life Student Activities Student Media Fraternity & Sorority Life Kennesaw Activities Board Student Affairs Dean of Students Office of the Dean of Students Student Advocacy Student Conduct & Academic Integrity Disability Services CARE Services Health & Well-being Wellbeing@KSU CARE Services Student Health Services Counseling & Psychological Services Sports & Recreation Wellness Center for Young Adult Addiction & Recovery Community & Leadership African American Male Initiative Diversity & Inclusion Cultural Awareness Resource Center LGBTQ Resource Center Military Community Student Government Association Student Leadership Women's Resource Center Student Centers Carmichael Student Center Wilson Student Center Talon One Service Center Sports & Entertainment Park Sustainability Biking at KSU Sustainability Tutoring Resources SMART Centers Writing Center English Language Program Engineering CLUE Center Computing Tutoring Business Tutoring Foreign Language Tutoring Statistics Tutoring Learning Assistant Program Supplemental Instruction Algebra Tutoring Need Help? Get Help. With resources from academic assistance to health and emergencies, these resources will allow you to get the immediate help and assistance you need at KSU. See Something, Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. We connect concerns with the resources to succeed and help to prevent crises. Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA. No matter where you choose to visit us, we hope you’ll love Kennesaw State University as much as we do. Academic Advising Advisors assist you in identifying and achieving your academic, career, and personal goals. They provide academic guidance in order to keep you on track for graduation and can help connect you to campus programs and services. You are assigned an academic advisor, or advising center, based on your intended major. We encourage you to meet with your advisor at least once each semester. Advising is not registration! You should meet with your advisor prior to the date you register for classes so you can discuss the best plan for the upcoming semester and beyond. Academic Advising Frequently Asked Questions How do I find out who my advisor is? You are assigned an advisor based on your intended major. Exploratory/undecided students are seen by Owl Advising, and students who have a major already identified are seen by the advisors in that department. In many cases, your advisor will be viewable in DegreeWorks. You can find more advising information by visiting https://advising.kennesaw.edu/who.php How do I know when it’s time to register each semester? The best way to plan ahead is to access the phased registration dates on the Registrar’s site. If these are not up to date, you can also click on the academic calendar to view many important dates for the University including the beginning and ending of each phase of registration. The first available time for you to register can be found by logging into Owl Express. How do I change my major? You can change/declare your major in Owl Express under the “student records” tab in Owl Express. What classes are required for my major? Each major has a specific list of required classes for graduation. Current KSU students should check DegreeWorks for this list. DegreeWorks is a web-based tool through Banner Web that provides real-time information on degree progression. DegreeWorks lists the courses you are required to take to complete your degree at KSU. This is available to you 24/7. Login to Owl Express (enter your KSU ID & Pin) Select the Student menu. Select DegreeWorks – Degree Audit. Your declared major worksheet will automatically load. There is also a “WHAT-IF” tab that gives you an unofficial view of how your credits will apply to a different major. (NOTE: If you officially change your major, you will be moved to the most recent Catalog regardless of when you started classes at KSU.) DegreeWorks does not replace face to face advising. You should continue to meet with your advisor to discuss degree-related concerns. Prospective students should contact the major department of interest for degree information. How do I find out about financial aid? Information on financial aid, including loans, FAFSA, Hope, and work-study opportunities, can be found online at the KSU Financial Aid site. How do I find out about scholarship opportunities? Your department may be aware of additional scholarships related to your field of study. In addition, the KSU library contains books with information with various scholarships and grants. Is there someone I can talk to about different career options? The Department of Career Planning and Development would be a great place to start. Additionally, the Counseling and Psychological Services Center conducts career and academic counseling. Finally, your advisors can help you see how your undergraduate major can lead you to many different careers. FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/online-students/", "title": "Online Students - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Online Students Kennesaw State University Online Students D2L Brightspace KSUMail Owl Express DegreeWorks Handshake Owl Life Course Evaluations Online Learning Support Academic Advising Library University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKSU unveils upgraded recreation and wellness center at Marietta campus Upcoming EventsSee all events Resources Computing Resources University Information Technology Services Service Portal Academic Resources Advising Global Education Learn Online Library Handbooks Owl Advising Registrar Testing Center Writing Center Finances Bursar's Office Financial Aid Financial Management Tuition and Fees International Community Global Education Global Village Maya Project Latino Program Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Dean of Students Office of the Dean of Students Student Advocacy Student Conduct & Academic Integrity Disability Services CARE Services Health & Wellbeing Wellbeing@KSU Student Health Services Counseling & Psychological Services Sports & Recreation Wellness Center for Young Adult Addiction & Recovery Community & Leadership African American Male Initiative Diversity & Inclusion Cultural Awareness Resource Center LGBTQ Resource Center Military Community Student Government Association Student Leadership Women's Resource Center Need Help? Get Help. With resources from academic assistance to health and emergencies, these resources will allow you to get the immediate help and assistance you need at KSU. See Something, Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification, we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA. No matter where you choose to visit us, we hope you’ll love Kennesaw State University as much as we do. Student Success Possessing computer skills and feeling comfortable online does not necessarily ensure your success in an online course. A common theme in online courses is self-discipline and persistence. At Kennesaw State, we are committed to helping our online students achieving their academic best. Online Student Success Frequently Asked Questions What are the benefits of online learning? Online learning provides considerable freedom, allowing students to often choose when and where they'll participate in class activities. Save time and money spent commuting to a campus Continue working at your current job while you are taking classes Attend your class from anywhere as long as you have a high-speed Internet connection Learn at your own pace and study at your convenience Learn new technologies Interact on equal footing Students will have the same kinds of deadlines and structured responsibilities of a face-to-face class. In other words, flexibility must be balanced by responsibility. Like a face-to-face course, online courses require assignments be completed by due dates, your attendance (via logins to your course), involvement in online discussions, and sometimes group collaboration. Most students enjoy the active learning that online classes involve. What are the challenges of online learning? Self-motivation and discipline are required to succeed in distance learning courses. For many, distance learning offers access to education not previously available. It also provides a solution to flexibility needs, work and travel responsibilities, and family challenges. A successful experience in distance learning requires a basic familiarity with technology. Resources are available for students through University Information Technology Services for those interested in distance learning, but in need of a technology refresher. It is also strongly recommended that students have ready access to a computer or laptop with a high-speed Internet access, such as DSL or cable broadband. Online courses will require students to download and access course materials. Online learning success depends on preparation, motivation, dedication, and planning. What equipment and technology will I need to be successful at online learning? Online learners will need a computer, Internet access, basic software (such as Microsoft Office Suite, Windows Media Player, Quicktime movie player, anti-virus protection and a compatible browser), and auxiliary equipment (such as a webcam and microphone headset for video-based communication). Of course, technology needs will vary by course. But this list applies to the majority of courses. Computer: Online Learners will need reliable access to a desktop or laptop computer that has adequate memory and processing capabilities for large file downloads, video players, and synchronous meeting applications. Auxiliary Equipment: The Digital Learning Innovations team also strongly recommends a WebCam and Headset for video-based communication. Many newer laptop or monitor set-ups are pre-equipped. These items may be required by faculty on a course-by-course basis. Internet Access: Online courses at KSU use the web to deliver courses at a distance. So, to learn in an online course smoothly, you need a high-speed Internet connection (such as DSL, Broadband, etc). This is especially important to the online learning experience. Software: While this will vary by course, you will need a recent version of the Microsoft Office Suite. Access to MS Word, MS PowerPoint, and MS Excel are expected and necessary for viewing course material or completing assignments. Additional requirements include anti-virus protection, Windows Media Player, QuickTime movie player, and a compatible browser. Visit UITS Training for additional information on software training, compatibility, and available downloads. HAVE MORE QUESTIONS? FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/faculty-staff/", "title": "Faculty & Staff - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Faculty & Staff Kennesaw State University Faculty & Staff D2L Brightspace KSUMail Owl Express KSU VPN OneUSG Connect KSU Connect KSU Today Banner A-Z Index Coronavirus Information Directory OneUSG Connect Calendar & Events University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKSU unveils upgraded recreation and wellness center at Marietta campus Upcoming EventsSee all events Resources Athletics & Recreation Esports KSU Owls Fifth Third Bank Stadium Sports & Recreation Computing Resources University Information Technology Services Service Portal Campus Services KSU Dining KSU Housing KSU Stores Events & Venue Management Parking & Transportation Public Safety & Police Student Health Talon Card Talon One Service Center Campus Services Curriculum, Instruction & Assessment Catalog Double Owl Pathways Instructional Resources Curriculum Committees Communication Resources Brand Guidelines Strategic Communications and Marketing Web Accessibility Guidelines Facilities Campus Moves Project and Space Requests Maintenance Requests Facilities Services Faculty & Staff Resources Academic Affairs Diverse and Inclusive Excellence Global Education Faculty Affairs Student Affairs Institutional Equity Testing Center Governance Administrators Council Chairs and Directors Assembly Faculty Senate Policy Process Council Staff Senate Student Government Association University Council Human Resources Benefits Compensation Careers at KSU Training and Development Human Resources Policies & Procedures Conflict of Interest Handbooks FERPA Policy Portal Protecting Minors Records and Information Management Smoke Free Kennesaw Talent Acquisition Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Sustainability Biking at KSU Sustainability Training & Development Online Learning Support Coursera Diversity Training Global Education UITS Training Services Prior Learning Assessment Health & Wellbeing Wellbeing@KSU CARE Services Student Health Services Counseling & Psychological Services Sports & Recreation Wellness Center for Young Adult Addiction & Recovery Faculty Web Faculty Web Directory Give KSU Foundation Office of Development Need Help? Get Help. With resources from academic assistance to health and emergencies, these resources will allow you to get the immediate help and assistance you need at KSU. See Something, Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification, we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA. No matter where you choose to visit us, we hope you’ll love Kennesaw State University as much as we do. Human Resources 2022-2024 Roadmap Human Resources is part of the KSU Administration Division. We collaborate with our campus partners to provide leading HR services that attract, develop, and retain employees in order to deliver an exceptional campus experience where everyone can thrive. Our comprehensive plan for HR's future are rooted in our guiding principles: Solution-Oriented Service, Collaboration, Integrity, and Model Positivity. We encourage you to check out our 2022-2024 Roadmap to learn more about Human Resources at Kennesaw State and our commitment to bring the very best to all KSU employees. View / Download the 2022-2024 HR Roadmap Frequently Asked Questions Where can I learn more about the benefits offered to KSU employees? Benefits information, including details on Health & Wellness, Leave of Absence & Worker's Comp, Training & Development, and Retirement, is located on the Human Resources website. What are employees able to do in OneUSG Connect? Employees use OneUSG Connect to record and submit time, access, review and update personal information including direct deposit, paystubs and benefits anytime, anywhere – by computer, tablet, even a smartphone. You can find out more about OneUSG Connect by visiting Human Resources' OneUSG Connect website. Where can I find out more about the Training & Development opportunities offered to KSU employees? KSU employee Training & Development information is located on the Human Resources website. The site offers details on the latest HR Training Calendar, HR OwlTrain courses, as well as a list of additional resources and training opportunities. FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/parents-family/", "title": "Parents & Family - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Parents & Family Kennesaw State University Parents & Family Owl Family Hub FAFSA Tuition & Fees Orientation Commencement KSU Owls Public Safety A-Z Index Parent and Family Association Financial Aid KSU Bookstore University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKSU unveils upgraded recreation and wellness center at Marietta campus Upcoming EventsSee all events Resources Visiting Campus Visit Campus Campus Map Commencement Academics Advising Global Education Learn Online Library Handbooks Owl Advising Registrar Testing Center Writing Center Finances Bursar's Office Financial Aid Scholarships Financial Management Tuition and Fees Student Health & Wellbeing Wellbeing@KSU CARE Services Student Health Services Counseling & Psychological Services Sports & Recreation Wellness Center for Young Adult Addiction & Recovery Campus Awareness, Resource & Empowerment Services (CARE) Disability Services LiveSafe Athletics & Recreation Esports KSU Owls Fifth Third Bank Stadium Sports & Recreation Campus Services KSU Dining KSU Housing KSU Stores Events & Venue Management Parking & Transportation Public Safety & Police Student Health Talon Card Talon One Service Center Campus Services Need Help? Get Help. With resources from academic assistance to health and emergencies, these resources will allow you to get the immediate help and assistance you need at KSU. See Something, Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification, we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA. No matter where you choose to visit us, we hope you’ll love Kennesaw State University as much as we do. Owl Family Hub Your number one source of information from Parent and Family Programs is our online parent and family portal, the KSU Parent and Family Experience! You'll receive newsletters filled with great information that is tailored to your student's experience. Join the portal today! Owl Family Hub Frequently Asked Questions How does academic advising work? Academic advisors at Kennesaw State University play a transformative role in the student experience through personalized and holistic strategies that promote each student's success. Through a collaborative relationship, we empower all students to take ownership of their education. We provide students with information about program requirements, coursework, campus resources, university policies and procedures, and career options. Embracing cross-campus collaboration, we work alongside faculty to help students become civically engaged, lifelong learners. We are fully committed to fostering a campus environment that respects and values the uniqueness and diversity of the students we serve. When are breaks and other important dates? The dates of the Academic Calendar are maintained by the Office of the Registrar and published each semester. How are students notified in case of an emergency? Kennesaw State University has developed a robust, multi-layered approach to emergency notification. This system is designed to reach the Kennesaw State University students, faculty, and staff in a variety of ways with immediate emergency messaging. Kennesaw State University utilizes outdoor warning sirens, email notifications, text notifications, voice phone call notifications, a desktop override system, the Kennesaw State University webpage, and social media pages to provide emergency messages to our students, faculty, staff, visitors, and other community stakeholders. The goal of this system is to provide multiple points of communication to ensure that the entire Kennesaw State University community is provided with timely and pertinent emergency messaging. What medical services are available on campus? Our KSU Student Health primary care clinics offer a variety of services: Illness diagnosis and care for colds, flu, sore throat, infections and more. Chronic disease management including asthma, diabetes, and hypertension. Routine exams, such as physicals, women’s and men's health, STD testing and treatment. Immunizations: routine and travel immunizations. Learn more about KSU's immunization requirements. The psychiatry clinical team is located in Kennesaw Hall (Kennesaw Campus) and the Joe Mack Wilson Student Center (Marietta Campus). To make an appointment, please visit the Counseling and Psychological Services website. Does my student need a permit to park at KSU? Yes, all students, faculty and staff must have a permit to park in any KSU parking area, including off-site shuttle lots. KSU allows one vehicle per permit to be on campus at a time. If two vehicles are on campus at the same time, both vehicles will be considered in violation, and both will receive a citation. Visitors and anyone who does not have a parking permit must utilize a Visitor parking area and pay at the pay-per-plate station in that lot. FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/alumni-friends/", "title": "Alumni & Friends - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Alumni & Friends Kennesaw State University Alumni & Friends Alumni Home Page Athletics Career Planning and Development KSU Foundation Library Cultural & Community Centers Retirees Association Recent Graduates Wingspan Newsletter Groups and Networks Show Your Owl Pride Support KSU University NewsSee all news Kennesaw State names recipients of 2023 Alumni AwardsKennesaw State graduate's national security and data analysis interests lead to defense jobKennesaw State alum takes love of analytics to the big leaguesKennesaw State alumna addresses new graduates, endows scholarship Upcoming EventsSee all events Resources Alumni Publications & News Wingspan Newsletter KSU Magazine Alumni Groups Association of Latino Alumni Black Alumni Society \"The Marching Owls\" Alumni Society SPSU Alumni Society KSU Alumni Young Professionals Homecoming Homecoming is an important annual celebration at KSU. New and returning Owls flock from all over the world to connect, engage, and enjoy our university traditions. Alumni Home Page Welcome to #ForeverOwl status! We are here to help you connect and enjoy lifelong relationships with fellow graduates, current students, and friends. Campus Maps KSU offers hundreds of special events throughout the year! Reconnect, stay involved, and bring your friends and family to visit KSU. Donors at Kennesaw State are one of our greatest assets The continued support from alumni and friends has enabled KSU to reach a greater level of excellence and attract top-notch students. The University remains a leader in higher education thanks to the gifts we receive from our generous donors. At KSU, donors truly make a difference. Give to KSU Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/community-business/", "title": "Community and Business - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Community and Business Kennesaw State University Community & Business Parking & Transportation Athletics Professional Education Campus Venues Filming on Campus Research Collaboration Economic Development and Community Engagement Hire a Student Recruit on Campus Concerts, Events & Exhibits Give to KSU University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKSU unveils upgraded recreation and wellness center at Marietta campus Upcoming EventsSee all events Resources Visiting Campus Visit Campus Campus Map Campus Services KSU Dining KSU Housing KSU Store Events & Venue Management Parking & Transportation Public Safety & Police Student Health Talon Card Talon One Service Center Campus Services Arts, Culture & Museums College of the Arts Concerts, Events, & Exhibits Zuckerman Museum of Art Museums, Archives, Rare Books Conferences & Event Spaces Kennesaw Campus Venues Marietta Campus Venues Public Forum Events & Venue Management Community Engagement Economic Development and Community Engagement KSU Alumni Association College of Professional Education Summer Camps \"Year of\" Country Study Government Relations Campus Resources Library System University Stores Testing Center Global Education Police Community Outreach GEAR UP Georgia TRiO Programs Learn Online Fifth Third Bank Stadium KSU Sports and Entertainment Park KSU Athletics Sports and Recreation Working with KSU Filming on Campus Media Contacts Careers at KSU Procurement Intern Housing Global Education KSU Partners Hire a Student Intern Recruit a Volunteer Connect with a Student Organization Career Planning and Development Handshake Login Research Resources Burruss Institute Research Computing KSU Research KSU Undergraduate Research Connect with Students Hire a Student Intern Recruit a Volunteer Connect with a Student Organization Give KSU Foundation Office of Development Need Help? Get Help. With resources from academic assistance to health and emergencies, these resources will allow you to get the immediate help and assistance you need at KSU. See Something, Say Something. KSU seeks to foster a proactive climate of care that can only be achieved through cooperative input from the entire community. Through identification, we can connect concerns with the resources to succeed and hopefully... Campus Maps Kennesaw State University includes two main campuses in Cobb County about 20-30 minutes north of Atlanta, GA. No matter where you choose to visit us, we hope you’ll love Kennesaw State University as much as we do. Doing Business with KSU Our goal is to do business with a diverse pool of companies that deliver quality, service, and value. We seek to develop business relationships that benefit both the University and the community. In other words, your success is our success. Doing Business with KSU Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/", "title": "Kennesaw State University in Georgia", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Play/Pause Discover your passion and purpose at KSU Find Your Degree See the Cost Apply to KSU Find Your Degree KSU offers 180+ bachelor's, master's, doctoral degrees and programs. Search below to find your degree or view Certificates and Minor programs. Search by Degree Type Undergraduate Graduate Online You're Invited to Open House @ KSU! KSU's Open House offers you the opportunity to learn more about your major and your desired field of study. For more information about this event and to see the event dates and sign up, please visit the link below. Open House Sign-Up! Why Choose KSU? Awesome Location Only 15 miles from the excitement of Atlanta, with even more excitement locally. Over 180 Programs A leader in innovative teaching and learning, KSU offers over 180 undergraduate, graduate and doctoral degrees and programs R2 University Kennesaw State is a Carnegie-designated doctoral research institution (R2), placing it among an elite group of only 6 percent of U.S. colleges. How much does it cost? KSU is dedicated to ensuring that you know what to expect financially, and helping you identify potential sources of financial aid. COST FOR BACHELOR'S COST FOR MASTER'S & DOCTORATE How do I apply? Apply for Bachelor's Apply for Master's & Doctorate University NewsSee all news Record Kennesaw State football crowd reflects student-engagement successMarching Owls take advantage of transitional football season for Kennesaw StateRenovated Kennesaw State Marietta Campus rec center reopensKennesaw State celebrates 10th cohort of Birla Carbon scholars Upcoming EventsSee all events FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics Discover Your Potential at KSU! REQUEST INFO VISIT APPLY Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/about/", "title": "About - Kennesaw State University - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar About KSU Kennesaw State University About KSU KSU at a Glance Facts and Figures Leadership Accreditation We are KSU Kennesaw State is a comprehensive university located on two suburban campuses in Kennesaw and Marietta, northwest of metro Atlanta. We are making an impact across the region, the nation and around the world. As the third largest university in Georgia, Kennesaw State has nearly 43,000 students enrolled in over 180 undergraduate, master’s, doctoral degree and certificate programs. KSU at a Glance KSU Owls Create Their Own Legacy Kennesaw State University is focused on growth, transformation and tenacity. This is our legacy. As one of Georgia’s largest research-driven universities, we put our students first – to empower them to seek and strive to discover their own path forward. We are KSU Owls and together, we ascend. Audio Description: Find Your Wings™ at Kennesaw State University 3rd Largest University in the state of Georgia 11 Colleges on two metro Atlanta campuses R2 Carnegie-designated doctoral research institution 42,000+ Enrolled students from the region and 100+ countries around the world Our Mission At Kennesaw State, we serve as a powerful example of the impact a student-centered, research-driven university education can deliver. We help students succeed through exploration, collaboration and rigor. We unite a diverse spectrum of backgrounds and talents to produce meaningful change. At KSU, students become the individuals that others want as colleagues and as leaders. Our Values Kennesaw State will exemplify the power and promise of a student-centered, research-driven university. Authentically diverse, uniquely attainable and endlessly impactful, we will unleash the potential in every student we serve. Student-inspired Promise-fulfilling True to ourselves Elevational Open Impact-generating Audio Description: KSU Values Leadership At KSU, our President, Kathy ‘Kat’ Schwaig, believes in prioritizing efforts that support student success. As a part of our Quality Enhancement Plan, we focus on the dynamic nature of engaged learning in each academic college and our university. We strive to collaborate with our campus community to grow Kennesaw State’s undergraduate and graduate programs, while supporting research efforts across the disciplines. Office of the President Kennesaw State Leads in Innovation, Teaching, and Learning At KSU, we put our students first in everything we do starting from day one. When you enroll at Kennesaw State, you will feel like coming home — a home where discovery and innovation thrive, where fond memories are made each day and where endless potential meets endless possibilities. As long as you're here, we will strive to produce... Quality Academics As a Carnegie-designated, doctoral research institution (R2), Kennesaw State is recognized in an elite group of only 6% of U.S. colleges with an R1 or R2 status by the Carnegie classification of institutions of higher learning. KSU offers undergraduate, master’s and doctoral programs. Top Majors KSU offers award-winning degrees and programs that produce the highest number of teachers and nurses in Georgia, the state’s third-largest business school and the state’s second-largest engineering college. Campus and Student Life KSU has 300+ student-led organizations enhancing collaboration and community. With a full range of world-class facilities, resources and activities, Kennesaw State has become a destination campus, where more than 5,200 students live in eight distinctive residential communities in Kennesaw and Marietta. Diverse Athletics KSU Athletics is committed to helping develop our student-athletes into Champions for Life. We have various sport and athletic programs for the ambitious and well-spirited students here at Kennesaw State including: Baseball, Basketball, Football, Cross Country, Track and Field, Golf, Tennis, Soccer, Softball, Volleyball, and Lacrosse. KSU Thrives as a Diverse Community The Division of Diverse and Inclusive Excellence fosters an inclusive learning and work environment. At KSU, we celebrate the wealth of diverse excellence that exists in our community. We engage with one another with respect as fellow humans. We promote an understanding and appreciation of differences through initiatives, programs, services and training. Our ultimate mission is to support excellence for all to produce transformative innovation and impact through essential diverse experiences. See how KSU Supports Diversity & Inclusion What We Care About at KSU Student-Centered Success Our students’ success is the reason for all we do here at KSU. Research with Relevance As an R2-designated research-driven university, we embrace exploration that delivers real-world impact. Learning through Engagement Collaboration is at our core – students, staff and faculty work hand-in-hand to inspire a culture of supportive, engaged learning. Future-Ready Graduates Our graduates are more than career ready – they’re ready to make an impact in our communities, our nation and around the world. Power of Perspective Our diverse backgrounds and experiences produce a collaborative spirit that opens the doors to new ideas and innovations. Facts and Figures KSU is Pushing the Boundaries Our students become innovators, complex thinkers and societal leaders. Kennesaw State University empowers students to seek, strive and succeed in academics and beyond. In addition to offering more than 180 degrees and certificates, KSU leads in innovative teaching and learning. Boasting two beautiful campuses in Kennesaw and Marietta, KSU offers undergraduate majors in STEM fields, nursing, arts, cybersecurity, business, and many more. KSU is a world-class institution in the University System of Georgia. We are regionally and nationally ranked and accredited. Explore our academic community, committed to engaged learning, impactful research, innovative pedagogy and inclusive excellence. Academic Affairs Fact Book Publications Peer Institutions Get Engaged at KSU 150+ State-of-the-Art Buildings 100+ Countries Represented 180+ Degrees & Programs 1,000+ Instructional Faculty KSU Has the Rankings Kennesaw State creates an atmosphere and academic programs that earn notable recognition for our institution and our students. Our programs, academic disciplines and curriculums are developed for student success. After our students graduate from KSU, they take these credentials with them in confidence—to their career field and through life. Ranked among National Universities in “2022-23 Best Colleges” US News & World Report \"Nation's Top 100 Degree Producers\" Diverse: Issues in Higher Education \"Top 50 Online MBA Programs and top 50 Game Design Programs for Undergraduates\" Princeton Review Kennesaw State is Accredited Kennesaw State University is proudly accredited by the Southern Association of Colleges and Schools Commission on Colleges (SACSCOC) to award baccalaureate, masters, specialist and doctorate degrees. Accreditation Campuses and Locations Kennesaw Campus 1000 Chastain RoadKennesaw, GA 30144Phone: 470-578-6000 Marietta Campus 1100 South Marietta PkwyMarietta, GA 30060Phone: 470-578-6000 Have Questions? Do you have a question about registration, what time the Big Owl Bus runs, what events are happening on campus this week, or anything in between? If so, just call 470-KSU-INFO (470-578-4636) any time Monday through Friday 8:00 a.m. - 5:00 p.m. You can also email ksuinfo@kennesaw.edu. KSU Info Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": ["ksuinfo@kennesaw.edu", "ksuinfo@kennesaw.edu"]},
{"pageid": "", "url": "https://www.kennesaw.edu/academics/", "title": " Academic  Programs - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Academic Programs Kennesaw State University Academics Degrees & Programs Top Majors International Programs Colleges Academic Centers, Institutes & Labs Library System World-Class Education As a world-class comprehensive university, Kennesaw State is recognized for our excellence in education, discovery, innovation, technology, and diverse engagement opportunities. Experience the empowerment of quality academics, inclusive learning cultures, and purposeful programs that provide each student with meaningful prospects that lead to success after graduation. At KSU, you will be a part of a community that supports you to develop your vision, build capabilities and become impactful, contributing members of society locally and around the world. Find Your Degree KSU offers 180+ bachelor's, master's, doctoral degrees and programs. Search below to find your degree or view Certificates and Minor programs. Search by Degree Type Undergraduate Graduate Online Double Owl Double Degrees Combine your undergraduate and graduate degree with Double Owl Pathways at KSU! Double Owl Pathways enable undergraduate students to obtain their undergraduate and graduate degrees at significantly lower costs and in less time than pursuing each degree separately. KSU offers numerous pathways to choose from across various disciplines, allowing students to graduate sooner and get a head start on their future careers. Discover pathways that fit your specific needs and interests! KSU Double Owl Pathways Online Learning at KSU Save time and money and enjoy the freedom of choosing when and where to participate in your degree courses. Continue working at your current job and learn at your own pace. Online learning at Kennesaw State University gives you the same structured responsibilities and academic support as face-to-face classes with the added benefit of convenience. Find the online program that works for you and apply today! Learn Online Top Enrolled Majors at KSU #1 Nursing #2 Psychology #3 Biology #4 Computer Science #5 Management #6 Marketing #7 Mechanical Engineering #8 Exercise Science #9 Finance #10 Criminal Justice *Based on Enrollment INTERNATIONAL PROGRAMS AT KSU Kennesaw State leads international endeavors by facilitating global partnerships, supporting our international population and coordinating programming at home and abroad. Global Education collaborates with and supports faculty and students to develop globally focused programs, research opportunities and partnerships at home and around the world to elevate our international presence. Global Education Learn more about our International Programs and opportunities at KSU! COLLEGES AT KSU Kennesaw State University houses 11 academic colleges with over 180 degrees and programs that provide you with a personalized education experience to support your passion and purpose. Discover our nationally recognized and ranked colleges here at KSU. Bagwell College of Education For those who are aspiring to become birth through 12th grade (B-12) professional educators, leaders and administrators, or higher education faculty and administrators, the Bagwell College of Education is one of Georgia’s top preparers of teachers. Our excellent faculty, staff, students and alumni continue to contribute to the strong reputation of KSU’s Bagwell College of Education. learn more Top Enrolled Undergraduate Degrees Elementary Education Middle Grades Education Secondary Education Top Enrolled Graduate Degrees Instructional Technology Teaching Secondary Education Coles College of Business Providing educational programs that provide students with exceptional value in the academic and business communities. By achieving prominence in selected areas and contributing to sustained regional economic growth, our business students will be a part of proactive engagement within the business community. Learn more Top Enrolled Undergraduate Degrees Marketing Management Finance Top Enrolled Graduate Degrees Business Administration Healthcare Management and Informatics Accounting College of Architecture and Construction Management Located in Marietta, Georgia, students gain innovative insights into a region noted for exciting new construction and structural repurposing. Offering rewarding internship possibilities, community engagement activities and a lively social scene that provides next-level architecture and construction education, students are prepared to construct a brighter future. learn more Top Enrolled Undergraduate Degrees Construction Management Architecture Top Enrolled Graduate Degree Construction Management College of Computing and Software Engineering Kennesaw State’s College of Computing and Software Engineering is one of the best in the country, with each of our degree programs recognized on a national scale. Accredited by the CAC Accreditation Commission of ABET in Computer Science, Information Technology and Software Engineering and Game Development, our students obtain the necessary skills to excel in leading industries. Learn more Top Enrolled Undergraduate Degrees Computer Science Information Technology Computer Game Design and Development Top Enrolled Graduate Degrees Computer Science Information Technology Software Engineering Norman J. Radow College of Humanities and Social Sciences As the largest of the 11 academic colleges, we work to prepare students for academic success and a promising future in the evolving marketplace that values your experience. Students are prepared with multidisciplinary learning, teamwork, critical thinking and problem solving to focus on innovation and ideas to help assist the human condition. learn more Top Enrolled Undergraduate Degrees Psychology Criminal Justice Media and Entertainment Top Enrolled Graduate Degrees Public Administration Professional Writing Conflict Management College of Science and Mathematics Preparing students for future success through innovative, high quality academic experiences in the areas of physical sciences, life sciences and mathematical processes. Combining high-level research activities and state-of-the-art teaching facilities with interdisciplinary courses, our students grow to meet the needs of tomorrow’s challenges. Learn more Top Enrolled Undergraduate Degrees Biology Chemistry Biochemistry Top Enrolled Graduate Degrees Integrative Biology Chemical Sciences College of the Arts With a vibrant collaboration of the School of Art and Design, Department of Dance, Bailey School of Music, and Department of Theatre and Performance Studies, our accomplished faculty and staff prepare students for success through transformational artistic and scholarly engagement. Our students advance as artists, engage in partnerships with professional arts organizations and go on to flourish as creative citizens locally and around the world. learn more Top Enrolled Undergraduate Degrees Art Digital Animation Theatre and Performance Studies Top Enrolled Graduate Degree Art and Design Graduate College It takes more to advance in your career than just ambition. At Kennesaw State, the Graduate College gives students the tools necessary to fuel ambitions and create a successful path forward. Our state-of-the-art facilities and convenient schedules serve to enhance your skills to become the solution to real-world challenges. We provide you with resources to help you successfully navigate your graduate journey, every step of the way. Learn more KSU Journey Honors College Offering a community within a university, KSU Journey Honors College fosters academically talented, highly motivated students who enjoy opportunities for lively discussion, creative expression and intellectual challenges. We allow students and educators to expand their curiosity, excel in academic achievements and develop lasting connections through service, leadership and global relations. prospective students current students Southern Polytechnic College of Engineering & Engineering Technology Georgia’s engineers are made here. We provide our students with high-quality engineering degrees led by industry-expert faculty members. As the second-largest engineering college in Georgia, our college serves more than 4,500 students with over 20 undergraduate and graduate engineering and engineering technology degrees. Learn more Top Enrolled Undergraduate Degrees Mechanical Engineering Electrical Engineering Civil Engineering Top Enrolled Graduate Degrees Engineering Management Mechanical Engineering Systems Engineering Wellstar College of Health and Human Services Comprised of various disciplines in the physical fitness, civic support and wellness communities, we offer “real-life” education that you can take into your career field. Our graduates exceed expectations in the workforce and interact in innovative learning environments. learn more Top Enrolled Undergraduate Degrees Nursing Exercise Science Sport Management Top Enrolled Graduate Degrees Social Work Primary Care Nurse Practitioner Leadership in Nursing Cyber Institute The Institute for Cybersecurity Workforce Development at Kennesaw State fosters essential collaboration within interdisciplinary fields to address the needs of the cybersecurity workforce. Students will develop the technical skills required to protect computerized information from a wide variety of cyber threats. Learn More Top Enrolled Undergraduate Degree Cybersecurity Top Enrolled Graduate Degree Cybersecurity Degree Finder Search KSU undergraduate, graduate, doctoral and professional development programs Apply Now Find your wings, apply today! Visit KSU Schedule a tour to experience the passion and culture behind being a KSU Owl ACADEMIC CENTERS, INSTITUTES & LABS Research extends beyond the classroom at KSU Offering immersive learning and dynamic environments , our students become leading innovators, researchers and developers with Kennesaw State’s various Academic Centers, Institutes & Labs. see what we have to offer LIBRARY AT KSU The KSU Library System is committed to supporting and furthering the resources, services and spaces needed to enhance the teaching, learning, research and creative endeavors of our KSU students, faculty, staff and visitors. Our efforts focus on student success – especially developing undergraduate programs, supporting graduate members, advancing research with relevance and promoting lifelong involved learning in our community. Research Possibilities at KSU Library System Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/admissions/", "title": "Admissions - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Play/Pause Admissions Kennesaw State University Admissions Undergraduate Admissions Graduate Admissions Financial Aid and Scholarships Visit Campus Professional Education YOUR FUTURE STARTS HERE AT KSU Your adventure is just beginning, and your journey begins now. When you come to Kennesaw State University, you'll join over 42,000 students throughout the Southeast and 102 countries worldwide. With 11 colleges on two metro Atlanta campuses, Kennesaw State is the third-largest university in the state and one of the best values in public education. KSU offers innovative, hands-on learning opportunities and a strong foundation in critical thinking that will prepare you to lead in your future career and community. Undergraduate Admissions Kennesaw State University empowers students to seek, strive and succeed in academics and beyond. In addition to offering more than 180 degrees and certificates, KSU leads in innovative teaching and learning. Boasting two beautiful campuses in Kennesaw and Marietta, KSU offers undergraduate majors in STEM fields, nursing, arts, cybersecurity, business, and many more. Visit Site Apply Now Owls by the Numbers 42,000+ Students 21:1 Student/Faculty Ratio 180+ Degrees & Programs R2 Designated Research University Find Your Degree KSU offers 180+ bachelor's, master's, doctoral degrees and programs. Search below to find your degree or view Certificates and Minor programs. Search by Degree Type Undergraduate Graduate Online Graduate Admissions Kennesaw State University gives you the tools you need to fuel your ambition and further your success. KSU offers more than 80 doctoral, master’s and graduate-level programs in various fields that are flexible, affordable and accredited. From top-tier research in state-of-the-art facilities to enhancing your skills to resolve real-world problems, we support you to continue your journey forward. Visit Site Apply Now Visit Campus You’ve got a big decision to make. See for yourself why KSU is the ideal choice. Our in-person campus tours are designed specifically for students and their families. Led by a tour guide, the campus tour highlights academic programs, housing, dining and admissions. You can choose to visit both the Kennesaw and Marietta campuses or the campus that houses your area of academic interest. Schedule Visit APPLY NOW Where We Call Home 159 Georgia Counties 46 States 102 Countries Students come to KSU from areas all over the state of Georgia, across the U.S. and around the world. Financial Aid & Scholarships Whether you’re a prospective student or close to graduating, we want to make sure you have the cost and financial aid information you need to make your KSU education possible. We’re here to answer your questions and help guide you through the financial aid process. Visit SIte Apply for Financial Aid Professional Education Investing in yourself is one of the best decisions you can make. Are you looking to advance in your current position? Want to change careers or start a new one? Get the training and expertise you need with a professional certificate designed to put you at the forefront of the job market. Choose from courses in technology, management, healthcare and more. Visit Site Apply Now FIND YOUR INTEREST Architecture & Construction Management Arts Business Computing & Software Engineering Cybersecurity Education Engineering & Engineering Technology Graduate Honors Humanities & Social Sciences Health & Human Services International Programs Online Programs Professional Education Science & Mathematics *Student profile based on Fall 2021 enrollment Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "", "url": "https://www.kennesaw.edu/student-life/", "title": "Student Life - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Student Life Kennesaw State University Student Life Community with Purpose Owl Nation Academic Growth and Support Campus Services Get Involved See Yourself at KSU At Kennesaw State, we put our students first in everything we do — all 42,000+ of them — and this starts from day one. When you enroll at Kennesaw State, you learn from our world-class faculty and gain academic support from in-the-know advisors. You’ll find your community by becoming involved in one or more of our 300+ student organizations, living in one of our on-campus residence halls and refueling at one of our award-winning campus dining options. And you’ll find your spirit cheering for one of our 18 NCAA Division I sports teams. Coming to KSU will feel like coming home — a home where discovery and innovation thrive, where fond memories are made each day and where potential meets possibility. OUR REACH IS FAR AND WIDE, YET OUR COMMUNITY IS FAMILIAR A Community with Purpose KSU is proud to support a diverse campus culture with strong global ties and an entrepreneurial spirit. Our vibrant campuses offer multiple on-campus residential communities, hundreds of student organizations and events throughout the year where you can find a supportive community and make lasting relationships. Through the Department of Student Affairs, you have numerous opportunities to create meaningful friendships and networking connections to maintain your successful academic and professional journey. Find Your Community FIND YOUR SPIRIT Owl Nation at KSU Behind every three-point shot, touchdown and goal scored stands an amazing KSU Owl. Work hard, play hard. That’s our unofficial motto around here. Our NCAA Division I student-athletes make KSU a better place through their commitment to academic excellence and community service. Owl Nation boasts over 30 intramural and club sports teams, making it easy for all students to find their interest, stay active and get involved. And with so many choices and top-tier facilities, rooting for the Black and Gold has never been easier. KSU Owls Intercollegiate Athletics KSU Club Sports Sports and Recreation Esports Fifth-Third Bank Stadium Involvement at KSU Make the most of your college experience at Kennesaw State. There are student organizations, activities, competition teams, leadership and service opportunities for all KSU students. Through your engagement, you increase your potential and enhance your academic, personal and professional experiences. During your time here at The Nest, we hope you make the most of your collegiate years by building your community and getting involved in some of the many possibilities available to you. Get Involved FIND YOUR PATH TO SUCCESS Academic Growth and Student Support Amazing things happen here, and it’s not by coincidence. Students at KSU support one another, and you will find a wealth of resources along with the encouragement of knowledgeable faculty to help you achieve your goals. At KSU, you will find ways to grow academically and personally as you pursue your dreams and prepare for a promising future. Academic Advising Academic Calendar Career Planning and Development Bookstore Course Catalog Library Wellbeing@KSU Make yourself a priority as a KSU student. Wellbeing@KSU is a comprehensive approach to your overall health and well-being to create a campus community of care. We provide a host of resources including 24/7 Mental Health Support to ensure your college experience keeps you feeling satisfied, happy and healthy. Advocacy and Prevention Center for Young Adult Addiction and Recovery Counseling and Psychological Services Health Promotion and Wellness Student Health Services Wellness Coaching VISIT KSU Take a Tour Today Kennesaw State University is passionate about supporting students from the moment they walk on campus through graduation day and beyond. We want you to see and experience what life on campus is like. take a ksu virtual tour Campus Services At Kennesaw State, our many Campus Services departments work together to provide the essentials of campus life along with exceptional customer service to the University’s students, faculty, staff and visiting guests. KSU Campus Services Housing & Residence Life University Dining Parking & Transportation Student Health Services Connect With Us Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": []},
{"pageid": "research.php", "url": "https://www.kennesaw.edu/research.php", "title": "Research - Kennesaw State University", "body": "Apply Visit Give Calendar Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business MENU Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business About KSU Academics Admissions Student Life Research Alumni Athletics Apply Visit Give Calendar Research at KSU Kennesaw State University Research Office of Research Carnegie Institute Research by the Numbers Undergraduate Research Graduate Research Faculty Research Research Leads to Innovation and Advancement Kennesaw State University is a student-centered, research driven R2 institution, placing it among the top 7% of research universities in the nation. With an emphasis on research with relevance, KSU’s research portfolio is varied and far-reaching, leading to new knowledge and discoveries by faculty and hands-on opportunities for students. Office of Research Kennesaw State’s Office of Research provides students and faculty members the opportunity to develop meaningful research to engage in important and innovative areas of scholarship in their field of interest. To support our KSU community, we provide world-class services and resources to bolster our journey as a top-tier R2 research institution. Among the Largest Suburban Research Universities in the U.S. All Colleges Supported for Research Opportunities Learn More About Research at KSU KSU is a Carnegie Designated Community Engaged Institution What is the Carnegie Classification? The Carnegie Classification is a leading foundation for acknowledging and defining diversity among universities in the United States. This classification is used to study higher education to exemplify the key differences in institutions as well as the design efforts of research studies to ensure that universities, faculty members, and students are appropriately represented. What does it mean to be a Carnegie Designated Community Engaged Institution? The Carnegie Foundation describes \"community engagement\" as the collaboration between higher education universities and their communities for the shared valuable exchange of learning and resources to produce a helpful partnership. Learn More About our Designation Research by the Numbers 350+ Proposals Submitted 170+ External Awards Received $12.5M+ in External Funding Awarded 4700+ Registrants for the Largest NCUR Meeting in History Undergraduate Research at KSU The Office of Undergraduate Research promotes high-quality undergraduate student-faculty collaborative research and scholarship in all disciplines across both campuses. Our students can pursue research and creative scholarship individually and in team-based research atmospheres. Kennesaw State Undergraduate Students will: Interact in all phases of the research process Investigate various topics that match their interests and aspirations Innovate solutions for real-world applications Talon’ted Undergraduate Researchers We want to feature you! Your interesting undergraduate research projects deserve to be displayed. Share your research story and we’ll rotate you on the Office of Undergraduate Research homepage and all of our associated social media platforms. Submit your undergraduate research project and/or creative activity for consideration. Feature Your Research Graduate Research at KSU We encourage our graduate students to apply the knowledge they gain in the classroom to the real world. As a University, we strive to create researchers who are innovative, boundary-pushing, lifelong scholars who take on challenging and creative projects that benefit the world at large. Kennesaw State Graduate Research Students will: Collaborate with world-class faculty members and fellow graduate students to produce transformative research publications Create and develop research through essential partnerships from your college and supportive businesses in industry Earn meaningful fundings, awards and world recognition through contributing to exhibitions and ground-breaking research We want to feature our talented graduate researchers! Your innovative research projects deserve to be displayed and supported. Share your research with us and we’ll feature you in our Investigator Research Magazine and all of our associated social media platforms. Submit your graduate research project and/or creative activity for consideration. Feature Your Research Faculty Research Our faculty are more than just educators. They consistently work on projects that foster exploration, ingenuity, and collaboration with students in all of our academic colleges and our community. Kennesaw State University faculty researchers lead by example by using their expertise to work on projects that make a positive impact on the world around us. Kennesaw State Faculty Researchers will: Participate in specific training and gather resources to compose and develop competitive grant proposals that add to the community here at KSU. Engage with graduate and undergraduate students to fulfill research needs focusing on intellectual property, sciences, community engagement, transgenerational health, innovative technologies and more. Develop new and improved initiatives to produce and promote unprecedented research and high-quality scholarship throughout the year. Summer Research Fellows at KSU Your role in supporting and furthering the research needs of KSU and our community is essential to our growth and success as a university! KSU hosts annual professional development and mentoring programs designed to help faculty members successfully apply for research grants from state and federal agencies, foundations and non-profit organizations. Interested in joining the Summer Research Fellows? email Engagement Opportunities KSU Day of Service Community Impact Day KSU Horizons Program SETS Program Faculty Service Awards Our Initiatives Drive Results Ready to Get Started with Your Research? Are you a student or faculty member conducting research at KSU? Let’s get your questions answered today! Start Your Research Feature Your Work KSU Symposium of Student Scholars National Conference on Undergraduate Research Kennesaw Journal of Undergraduate Research Undergraduate Research Club Connect with Us! Contact Info Kennesaw Campus1000 Chastain RoadKennesaw, GA 30144 Marietta Campus1100 South Marietta PkwyMarietta, GA 30060 Campus Maps Phone470-KSU-INFO(470-578-4636) kennesaw.edu/info Media Resources Resources For Current Students Online Only Students Faculty & Staff Parents & Family Alumni & Friends Community & Business Related Links Libraries Housing Financial Aid Degrees, Majors & Programs Registrar Job Opportunities Campus Security Global Education Diverse & Inclusive Excellence Sustainability Accessibility Follow KSU 470-KSU-INFO (470-578-4636) © 2023 Kennesaw State University. All Rights Reserved. Privacy Statement Accreditation Emergency Information Reporting Hotline Feedback Open Records Human Trafficking Notice Text Only ©", "emails": ["researchdev@kennesaw.edu"]}
]